olliw42/stm32ll-lib/src/stdstm32-uarte.h
//*******************************************************
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// my stripped down UART standard library
// only ISR, no DMA, no wait and tmo rx functions, no convenience functions
//*******************************************************
// Interface:
//
// #define UARTE_USE_UART1, UARTE_USE_UART1_PA9PA10, UARTE_USE_UART1_PB6PB7, UARTE_USE_UART1_PC4PC5, UARTE_USE_UART1_PB14PB15
// #define UARTE_USE_UART2, UARTE_USE_UART2_PA2PA3, UARTE_USE_UART2_PD5PD6, UARTE_USE_UART2_PB3PB4, UARTE_USE_UART2_PA14PA15, UARTE_USE_UART2_PA5PA15
// #define UARTE_USE_UART3, UARTE_USE_UART3_PB10PB11, UARTE_USE_UART3_PC10PC11, UARTE_USE_UART3_PB8PB9, UARTE_USE_UART3_PA4PA3, UARTE_USE_UART3_PB3PB8
// #define UARTE_USE_UART4, UARTE_USE_UART4_PC10PC11, UARTE_USE_UART4_PA0PA1
// #define UARTE_USE_UART5, UARTE_USE_UART5_PC12PD2
// #define UARTE_USE_UART6, UARTE_USE_UART6_PC6PC7, UARTE_USE_UART6_PG14PG9
// #define UARTE_USE_UART7, UARTE_USE_UART7_PE8PE7, UARTE_USE_UART7_PF7PF6, UARTE_USE_UART7_PB4PB3, UARTE_USE_UART7_PA15PA8
// #define UARTE_USE_UART8, UARTE_USE_UART8_PE1PE0
// #define UARTE_USE_LPUART1, UARTE_USE_LPUART1_PA2PA3, UARTE_USE_LPUART1_PC1PC0, UARTE_USE_LPUART1_PA9PA10, UARTE_USE_LPUART1_PB6PB7
//
// #define UARTE_BAUD
//
// #define UARTE_USE_TX
// #define UARTE_TXBUFSIZE
// #define UARTE_USE_TX_ISR
// #define UARTE_USE_TX_DMA
// #define UARTE_INVERTED
//
// #define UARTE_USE_RX
// #define UARTE_RXBUFSIZE
//
// #define UARTE_IRQ_PRIORITY
//
// #define UARTE_USE_RXERRORCOUNT
//
// #define UARTE_RX_CALLBACK_FULL(c)
// #define UARTE_TC_CALLBACK() // ATTENTION: when used, one never should trigger TC isr without a byte written to the tx buffer
//
//*******************************************************
#ifndef STDSTM32_UARTE_H
#define STDSTM32_UARTE_H
#ifdef __cplusplus
extern "C" {
#endif


//-------------------------------------------------------
// Enums
//-------------------------------------------------------
// in order to not introduce hardware dependency upstream
// we define our own enums for parity and stopbits

#ifndef UART_ENUMS
#define UART_ENUMS

typedef enum {
  XUART_PARITY_NO = LL_USART_PARITY_NONE, // XUART_xxx to avoid overlap with HAL
  XUART_PARITY_EVEN = LL_USART_PARITY_EVEN,
  XUART_PARITY_ODD = LL_USART_PARITY_ODD,
  XUART_PARITY_MAKEITU32 = UINT32_MAX,
} UARTPARITYENUM;

typedef enum {
#ifdef LL_USART_STOPBITS_0_5
  UART_STOPBIT_0_5 = LL_USART_STOPBITS_0_5, // not allowed for LPUART, and some STM32F0!
#endif
  UART_STOPBIT_1 = LL_USART_STOPBITS_1,
#ifdef LL_USART_STOPBITS_1_5
  UART_STOPBIT_1_5 = LL_USART_STOPBITS_1_5, // not allowed for LPUART, and some STM32!
#endif
  UART_STOPBIT_2 = LL_USART_STOPBITS_2,
  UART_STOPBIT_MAKEITU32 = UINT32_MAX,
} UARTSTOPBITENUM;

#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if (defined UARTE_USE_TX_ISR) && (!defined UARTE_USE_TX)
  #error UARTE_USE_TX_ISR used without UARTE_USE_TX!
#endif
#if (defined UARTE_USE_RXERRORCOUNT) && (!defined UARTE_USE_RX)
  #error UARTE_USE_RXERRORCOUNT used without UARTE_USE_RX!
#endif

#ifdef UARTE_USE_TX_DMA
  #error UARTE_USE_TX_DMA not supported by this library!
#endif


#ifndef UARTE_BAUD
  #define UARTE_BAUD             115200UL // 9600UL
#endif


#ifdef UARTE_USE_TX_ISR
  #ifndef UARTE_TXBUFSIZE
    #define UARTE_TXBUFSIZE      256 // MUST be 2^N
  #endif
  #if UARTE_TXBUFSIZE < 2
    #error UARTE_TXBUFSIZE must be larger than 1 !
  #elif ((UARTE_TXBUFSIZE & (UARTE_TXBUFSIZE-1)) != 0)
    #error UARTE_TXBUFSIZE must be a power of 2 !
  #endif

  #define UARTE_TXBUFSIZEMASK  (UARTE_TXBUFSIZE-1)

  volatile char uarte_txbuf[UARTE_TXBUFSIZE];
  volatile uint16_t uarte_txwritepos; // pos at which the last byte was stored
  volatile uint16_t uarte_txreadpos; // pos at which the next byte is to be fetched
#endif


#ifdef UARTE_USE_RX
  #ifndef UARTE_RXBUFSIZE
    #define UARTE_RXBUFSIZE      256 //128 //MUST be 2^N
  #endif
  #if UARTE_RXBUFSIZE < 2
    #error UARTE_RXBUFSIZE must be larger than 1 !
  #elif ((UARTE_RXBUFSIZE & (UARTE_RXBUFSIZE-1)) != 0)
    #error UARTE_RXBUFSIZE must be a power of 2 !
  #endif

  #define UARTE_RXBUFSIZEMASK  (UARTE_RXBUFSIZE-1)

  volatile char uarte_rxbuf[UARTE_RXBUFSIZE];
  volatile uint16_t uarte_rxwritepos; // pos at which the last byte was stored
  volatile uint16_t uarte_rxreadpos; // pos at which the next byte is to be fetched

  #ifdef UARTE_USE_RXERRORCOUNT
  volatile uint32_t uarte_errorcnt_rxnoise;
  volatile uint32_t uarte_errorcnt_rxframe;
  volatile uint32_t uarte_errorcnt_rxoverrun;
  #endif
#endif


// catch legacy defines
#if defined UARTE_USE_UART1_REMAPPED || defined UARTE_USE_UART1_REMAPPED2
  #error REMAPPED not supported anymore!
#endif
#if defined UARTE_USE_UART2_REMAPPED || defined UARTE_USE_UART2_REMAPPED2 || defined UARTE_USE_UART2_REMAPPED3
  #error REMAPPED not supported anymore!
#endif
#if defined UARTE_USE_UART3_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTE_USE_UART4_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTE_USE_UART6_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTE_USE_UART7_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTE_USE_LPUART1_REMAPPED
  #error REMAPPED not supported anymore!
#endif


// the H5 arms below tell the H503 and H56x pin maps apart via STM32H5_H56x,
// see stdstm32-peripherals.h


#if defined UARTE_USE_UART1 || defined UARTE_USE_UART1_PA9PA10 || defined UARTE_USE_UART1_PB6PB7 || defined UARTE_USE_UART1_PC4PC5 || \
      defined UARTE_USE_UART1_PB14PB15
  #define UARTE_UARTx             USART1
  #ifdef UARTE_USE_UART1
    // user needs to specify UARTE_USE_TX_IO, UARTE_USE_RX_IO, and possibly UARTE_USE_IO_AF
  #elif defined UARTE_USE_UART1_PA9PA10
    #define UARTE_TX_IO           IO_PA9
    #define UARTE_RX_IO           IO_PA10
  #elif defined UARTE_USE_UART1_PB6PB7 // was UART1_REMAPPED
    #define UARTE_TX_IO           IO_PB6
    #define UARTE_RX_IO           IO_PB7
  #elif defined UARTE_USE_UART1_PC4PC5 // only G4 // was UART1_REMAPPED2
    #define UARTE_TX_IO           IO_PC4
    #define UARTE_RX_IO           IO_PC5
  #elif defined UARTE_USE_UART1_PB14PB15 // only H5
    #define UARTE_TX_IO           IO_PB14
    #define UARTE_RX_IO           IO_PB15
  #endif
  #ifndef STM32F0
    #define UARTE_IO_AF           IO_AF_7
  #else
    #ifdef UARTE_USE_UART1
      // user needs to specify UARTE_USE_IO_AF
    #elif defined UARTE_USE_UART1_PA9PA10
      #define UARTE_IO_AF         IO_AF_1
    #elif defined UARTE_USE_UART1_PB6PB7
      #define UARTE_IO_AF         IO_AF_0
    #else
      #error UARTE_USE_UART1 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTE_IRQn              USART1_IRQn
  #define UARTE_IRQHandler        USART1_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #elif defined STM32H5
    // H5: PA9/PA10 and PB6/PB7 are AF7 as set above, PB14/PB15 are AF4, on both lines
    #if defined UARTE_USE_UART1_PB14PB15
      #undef UARTE_IO_AF
      #define UARTE_IO_AF         IO_AF_4
    #elif defined UARTE_USE_UART1_PC4PC5
      #error UARTE_USE_UART1_PC4PC5 not available on STM32H5 !
    #endif
  #endif

#elif defined UARTE_USE_UART2 || defined UARTE_USE_UART2_PA2PA3 || defined UARTE_USE_UART2_PD5PD6 || \
      defined UARTE_USE_UART2_PB3PB4 || defined UARTE_USE_UART2_PA14PA15 || defined UARTE_USE_UART2_PB3PA15 || \
      defined UARTE_USE_UART2_PA5PA15
  #define UARTE_UARTx             USART2
  #ifdef UARTE_USE_UART2
    // user needs to specify UARTE_USE_TX_IO, UARTE_USE_RX_IO, and possibly UARTE_USE_IO_AF
  #elif defined UARTE_USE_UART2_PA2PA3
    #define UARTE_TX_IO           IO_PA2
    #define UARTE_RX_IO           IO_PA3
  #elif defined UARTE_USE_UART2_PD5PD6 // was UART2_REMAPPED
    #define UARTE_TX_IO           IO_PD5
    #define UARTE_RX_IO           IO_PD6
  #elif defined UARTE_USE_UART2_PB3PB4 // only G4 // was UART2_REMAPPED2
    #define UARTE_TX_IO           IO_PB3
    #define UARTE_RX_IO           IO_PB4
  #elif defined UARTE_USE_UART2_PA14PA15 // only G4, F0 // ATTENTION: on G4 PA14 overlaps with SWCLK // was UART2_REMAPPED3
    #define UARTE_TX_IO           IO_PA14
    #define UARTE_RX_IO           IO_PA15
  #elif defined UARTE_USE_UART2_PB3PA15 // only G4
    #define UARTE_TX_IO           IO_PB3
    #define UARTE_RX_IO           IO_PA15
  #elif defined UARTE_USE_UART2_PA5PA15 // only H5, the AN2606 bootloader pair
    #define UARTE_TX_IO           IO_PA5
    #define UARTE_RX_IO           IO_PA15
  #endif
  #ifndef STM32F0
    #define UARTE_IO_AF           IO_AF_7
  #else
    #if defined UARTE_USE_UART2
      // user needs to specify UARTE_USE_IO_AF
    #elif defined UARTE_USE_UART2_PA2PA3 || defined UARTE_USE_UART2_PA14PA15
      #define UARTE_IO_AF         IO_AF_1
    #else
      #error UARTE_USE_UART2 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTE_IRQn              USART2_IRQn
  #define UARTE_IRQHandler        USART2_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #elif defined STM32H5
    // H5: PA2/PA3 is AF7 as set above on both lines, everything else differs
    #if defined STM32H5_H56x
      // H56x has USART2 only on PA2/PA3 and PD5/PD6, and PD5/PD6 is not bonded
      #if defined UARTE_USE_UART2_PD5PD6
        #error UARTE_USE_UART2_PD5PD6 not bonded on STM32H56x packages up to LQFP64 ! use UARTE_USE_UART2_PA2PA3
      #elif defined UARTE_USE_UART2_PA5PA15 || defined UARTE_USE_UART2_PB3PB4 || \
            defined UARTE_USE_UART2_PA14PA15 || defined UARTE_USE_UART2_PB3PA15
        #error UARTE_USE_UART2 mapping not available on STM32H56x ! use UARTE_USE_UART2_PA2PA3
      #endif
    #else
      // H503, the other mappings use different AFs
      #if defined UARTE_USE_UART2_PB3PB4
        #undef UARTE_IO_AF
        #define UARTE_IO_AF       IO_AF_13
      #elif defined UARTE_USE_UART2_PA14PA15
        #undef UARTE_IO_AF
        #define UARTE_IO_AF       IO_AF_9 // ATTENTION: PA14 overlaps with SWCLK
      #elif defined UARTE_USE_UART2_PA5PA15
        #undef UARTE_IO_AF
        #define UARTE_IO_AF       IO_AF_9
      #elif defined UARTE_USE_UART2_PD5PD6
        #error UARTE_USE_UART2_PD5PD6 not available on STM32H503 !
      #elif defined UARTE_USE_UART2_PB3PA15
        #error UARTE_USE_UART2_PB3PA15 not available on STM32H503 !
      #endif
    #endif
  #endif

#elif defined UARTE_USE_UART3 || defined UARTE_USE_UART3_PB10PB11 || defined UARTE_USE_UART3_PC10PC11 || defined UARTE_USE_UART3_PB8PB9 || \
      defined UARTE_USE_UART3_PA4PA3 || defined UARTE_USE_UART3_PB3PB8
  #define UARTE_UARTx             USART3
  #if defined UARTE_USE_UART3
    // user needs to specify UARTE_USE_TX_IO, UARTE_USE_RX_IO, and possibly UARTE_USE_IO_AF
  #elif defined UARTE_USE_UART3_PB10PB11
    #define UARTE_TX_IO           IO_PB10
    #define UARTE_RX_IO           IO_PB11
  #elif defined UARTE_USE_UART3_PC10PC11 // was UART3_REMAPPED
    #define UARTE_TX_IO           IO_PC10
    #define UARTE_RX_IO           IO_PC11
  #elif defined UARTE_USE_UART3_PB8PB9 // only F3
    #define UARTE_TX_IO           IO_PB8
    #define UARTE_RX_IO           IO_PB9
  #elif defined UARTE_USE_UART3_PA4PA3 // only H5
    #define UARTE_TX_IO           IO_PA4
    #define UARTE_RX_IO           IO_PA3
  #elif defined UARTE_USE_UART3_PB3PB8 // only H5
    #define UARTE_TX_IO           IO_PB3
    #define UARTE_RX_IO           IO_PB8
  #else
  #endif
  #ifndef STM32F0
    #define UARTE_IO_AF           IO_AF_7
  #else
    #if defined UARTE_USE_UART3
      // user needs to specify UARTE_USE_IO_AF
    #elif defined defined UARTE_USE_UART3_PB10PB11 || defined UARTE_USE_UART3_PB8PB9
      #define UARTE_IO_AF         IO_AF_4
    #elif defined UARTE_USE_UART3_PC10PC11
      #define UARTE_IO_AF         IO_AF_1
    #else
      #error UARTE_USE_UART3 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTE_IRQn              USART3_IRQn
  #define UARTE_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
    #error UART3 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTE_IRQn
    #undef UARTE_IRQHandler
    #define UARTE_IRQn            USART3_4_IRQn
    #define UARTE_IRQHandler      USART3_4_IRQHandler
  #elif defined STM32H5
    #if defined STM32H5_H56x
      // H56x USART3 is AF7 as set above, and only PC10/PC11 is bonded up to LQFP64
      #if defined UARTE_USE_UART3_PB10PB11
        #error UARTE_USE_UART3_PB10PB11 not bonded on STM32H56x packages up to LQFP64, PB11 is missing ! use UARTE_USE_UART3_PC10PC11
      #elif defined UARTE_USE_UART3_PB8PB9
        #error UARTE_USE_UART3_PB8PB9 not bonded on STM32H56x packages up to LQFP64, PB9 is missing ! use UARTE_USE_UART3_PC10PC11
      #elif defined UARTE_USE_UART3_PA4PA3 || defined UARTE_USE_UART3_PB3PB8
        #error UARTE_USE_UART3 mapping not available on STM32H56x ! use UARTE_USE_UART3_PC10PC11
      #endif
    #else
      // H503 USART3 is AF13 for the mappings reachable on the 48 pin package.
      // PB11 and PB9 do not exist on H503, and PC10/PC11 are not bonded on LQFP48.
      #if defined UARTE_USE_UART3_PA4PA3 || defined UARTE_USE_UART3_PB3PB8
        #undef UARTE_IO_AF
        #define UARTE_IO_AF       IO_AF_13
      #elif defined UARTE_USE_UART3_PB10PB11
        #error UARTE_USE_UART3_PB10PB11 not available on STM32H503, PB11 does not exist ! use UARTE_USE_UART3_PA4PA3 or UARTE_USE_UART3_PB3PB8
      #elif defined UARTE_USE_UART3_PB8PB9
        #error UARTE_USE_UART3_PB8PB9 not available on STM32H503, PB9 does not exist ! use UARTE_USE_UART3_PB3PB8
      #elif defined UARTE_USE_UART3_PC10PC11
        #error UARTE_USE_UART3_PC10PC11 not available on STM32H503 LQFP48, port C is not bonded !
      #endif
    #endif
  #endif

#elif defined UARTE_USE_UART4 || defined UARTE_USE_UART4_PC10PC11 || defined UARTE_USE_UART4_PA0PA1
  #define UARTE_UARTx             UART4
  #ifdef UARTE_USE_UART4
    // user needs to specify UARTE_USE_TX_IO, UARTE_USE_RX_IO, and possibly UARTE_USE_IO_AF
  #elif defined UARTE_USE_UART4_PC10PC11
    #define UARTE_TX_IO           IO_PC10
    #define UARTE_RX_IO           IO_PC11
  #elif defined UARTE_USE_UART4_PA0PA1 // only F7, H56x // was UART4_REMAPPED
    #define UARTE_TX_IO           IO_PA0
    #define UARTE_RX_IO           IO_PA1
  #endif
  #if defined STM32F1
    #define UARTE_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F7
    #define UARTE_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTE_IO_AF           IO_AF_5
  #elif defined STM32H5_H56x
    #define UARTE_IO_AF           IO_AF_8
  #endif
  #define UARTE_IRQn              UART4_IRQn
  #define UARTE_IRQHandler        UART4_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
    #warning UARTE IO_AF & DMA for F3 still TODO
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART4 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTE_IRQn
    #undef UARTE_IRQHandler
    #define UARTE_IRQn            USART3_4_IRQn
    #define UARTE_IRQHandler      USART3_4_IRQHandler
  #elif defined STM32H5
    // H56x has UART4 on PA0/PA1 and PC10/PC11, both AF8 and bonded up to LQFP64
    #if !defined STM32H5_H56x
      #error UART4 NOT AVAILABLE on STM32H503 !
    #endif
  #endif

#elif defined UARTE_USE_UART5 || defined UARTE_USE_UART5_PC12PD2
  #define UARTE_UARTx             UART5
  #ifdef UARTE_USE_UART5
    // user needs to specify UARTE_USE_TX_IO, UARTE_USE_RX_IO, and possibly UARTE_USE_IO_AF
  #elif defined UARTE_USE_UART5_PC12PD2
    #define UARTE_TX_IO           IO_PC12
    #define UARTE_RX_IO           IO_PD2
  #endif
  #define UARTE_IRQn              UART5_IRQn
  #define UARTE_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UARTE_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UARTE IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UARTE_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTE_IO_AF           IO_AF_5
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART5 NOT AVAILABLE !
  #elif defined STM32H5
    // H56x has UART5 on PC12/PD2, AF8 and bonded up to LQFP64
    #if defined STM32H5_H56x
      #define UARTE_IO_AF         IO_AF_8
    #else
      #error UART5 NOT AVAILABLE on STM32H503 !
    #endif
  #endif

#elif defined UARTE_USE_UART6 || defined UARTE_USE_UART6_PC6PC7 || defined UARTE_USE_UART6_PG14PG9
  #define UARTE_UARTx             USART6
  #ifdef UARTE_USE_UART6
    // user needs to specify UARTE_USE_TX_IO, UARTE_USE_RX_IO, and possibly UARTE_USE_IO_AF
  #elif defined UARTE_USE_UART6_PC6PC7
    #define UARTE_TX_IO           IO_PC6
    #define UARTE_RX_IO           IO_PC7
  #elif defined UARTE_USE_UART6_PG14PG9 // was UART6_REMAPPED
    #define UARTE_TX_IO           IO_PG14
    #define UARTE_RX_IO           IO_PG9
  #endif
  #define UARTE_IO_AF             IO_AF_8
  #define UARTE_IRQn              USART6_IRQn
  #define UARTE_IRQHandler        USART6_IRQHandler

