olliw42/stm32ll-lib/src/stdstm32-uarte.h
  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32H5
    // H56x USART6 is AF7, not AF8, and only PC6/PC7 is bonded up to LQFP64
    #if !defined STM32H5_H56x
      #error UART6 NOT AVAILABLE on STM32H503 !
    #elif defined UARTE_USE_UART6_PG14PG9
      #error UARTE_USE_UART6_PG14PG9 not bonded on STM32H56x packages up to LQFP64 ! use UARTE_USE_UART6_PC6PC7
    #else
      #undef UARTE_IO_AF
      #define UARTE_IO_AF         IO_AF_7
    #endif
  #endif

#elif defined UARTE_USE_UART7 || defined UARTE_USE_UART7_PE8PE7 || defined UARTE_USE_UART7_PF7PF6 || \
      defined UARTE_USE_UART7_PB4PB3 || defined UARTE_USE_UART7_PA15PA8
  #define UARTE_UARTx             UART7
  #ifdef UARTE_USE_UART7
    // user needs to specify UARTE_USE_TX_IO, UARTE_USE_RX_IO, and possibly UARTE_USE_IO_AF
  #elif defined UARTE_USE_UART7_PE8PE7
    #define UARTE_TX_IO           IO_PE8
    #define UARTE_RX_IO           IO_PE7
  #elif defined UARTE_USE_UART7_PF7PF6 // was UART7_REMAPPED
    #define UARTE_TX_IO           IO_PF7
    #define UARTE_RX_IO           IO_PF6
  #elif defined UARTE_USE_UART7_PB4PB3 // only H56x
    #define UARTE_TX_IO           IO_PB4
    #define UARTE_RX_IO           IO_PB3
  #elif defined UARTE_USE_UART7_PA15PA8 // only H56x // ATTENTION: PA15 is JTDI
    #define UARTE_TX_IO           IO_PA15
    #define UARTE_RX_IO           IO_PA8
  #endif
  #define UARTE_IO_AF             IO_AF_8
  #define UARTE_IRQn              UART7_IRQn
  #define UARTE_IRQHandler        UART7_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART7 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32H5
    // H56x UART7 is AF11, not AF8, and only PB4/PB3 and PA15/PA8 are bonded up to LQFP64
    #if !defined STM32H5_H56x
      #error UART7 NOT AVAILABLE on STM32H503 !
    #elif defined UARTE_USE_UART7_PE8PE7 || defined UARTE_USE_UART7_PF7PF6
      #error UARTE_USE_UART7 mapping not bonded on STM32H56x packages up to LQFP64 ! use UARTE_USE_UART7_PB4PB3 or UARTE_USE_UART7_PA15PA8
    #else
      #undef UARTE_IO_AF
      #define UARTE_IO_AF         IO_AF_11
    #endif
  #endif

#elif defined UARTE_USE_UART8 || defined UARTE_USE_UART8_PE1PE0
  #define UARTE_UARTx             UART8
  #ifdef UARTE_USE_UART8
    // user needs to specify UARTE_USE_TX_IO, UARTE_USE_RX_IO, and possibly UARTE_USE_IO_AF
  #elif defined UARTE_USE_UART8_PE1PE0
    #define UARTE_TX_IO           IO_PE1
    #define UARTE_RX_IO           IO_PE0
  #endif
  #define UARTE_IO_AF             IO_AF_8
  #define UARTE_IRQn              UART8_IRQn
  #define UARTE_IRQHandler        UART8_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART8 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32H5
    // H56x has UART8, but none of its pins is bonded up to LQFP64
    #if defined STM32H5_H56x
      #error UART8 has no pins bonded on STM32H56x packages up to LQFP64 !
    #else
      #error UART8 NOT AVAILABLE on STM32H503 !
    #endif
  #endif

#elif defined UARTE_USE_LPUART1 || defined UARTE_USE_LPUART1_PA2PA3 || defined UARTE_USE_LPUART1_PC1PC0 || \
      defined UARTE_USE_LPUART1_PA9PA10 || defined UARTE_USE_LPUART1_PB6PB7
  #define UARTE_UARTx             LPUART1
  #ifdef UARTE_USE_LPUART1
    // user needs to specify UARTE_USE_TX_IO, UARTE_USE_RX_IO, and possibly UARTE_USE_IO_AF
  #elif defined UARTE_USE_LPUART1_PA2PA3
    #define UARTE_TX_IO           IO_PA2
    #define UARTE_RX_IO           IO_PA3
    #ifdef STM32G4
      #define UARTE_IO_AF         IO_AF_12 // G4
    #elif defined STM32H5_H56x
      // H56x has no LPUART1 on PA2/PA3, caught further below
    #elif defined STM32H5
      // H503 has a silicon swap here: PA2=LPUART1_RX, PA3=LPUART1_TX (AF3).
      #undef UARTE_TX_IO
      #undef UARTE_RX_IO
      #define UARTE_TX_IO         IO_PA3
      #define UARTE_RX_IO         IO_PA2
      #define UARTE_IO_AF         IO_AF_3
    #else
      #define UARTE_IO_AF         IO_AF_8 // WL
    #endif
  #elif defined UARTE_USE_LPUART1_PC1PC0 // was LPUART1_REMAPPED
    #define UARTE_TX_IO           IO_PC1
    #define UARTE_RX_IO           IO_PC0
    #define UARTE_IO_AF           IO_AF_8
  #elif defined UARTE_USE_LPUART1_PA9PA10 // only H5, not swapped
    #define UARTE_TX_IO           IO_PA9
    #define UARTE_RX_IO           IO_PA10
    #define UARTE_IO_AF           IO_AF_3
  #elif defined UARTE_USE_LPUART1_PB6PB7 // only H5, not swapped
    #define UARTE_TX_IO           IO_PB6
    #define UARTE_RX_IO           IO_PB7
    #define UARTE_IO_AF           IO_AF_8
  #endif
  #if defined UARTE_USE_LPUART1_PA2PA3 && defined STM32H5_H56x
    // no pins were assigned above
    #error UARTE_USE_LPUART1_PA2PA3 not available on STM32H56x ! use UARTE_USE_LPUART1_PA9PA10 or UARTE_USE_LPUART1_PB6PB7
  #endif
  #define UARTE_IRQn              LPUART1_IRQn
  #define UARTE_IRQHandler        LPUART1_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32F7
    #error LPUART1 NOT AVAILABLE !
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
  #elif defined STM32H5
    #if defined UARTE_USE_LPUART1_PC1PC0
      #if defined STM32H5_H56x
        // PC0/PC1 are bonded on LQFP64, but carry SAI2, not LPUART1
        #error UARTE_USE_LPUART1_PC1PC0 not available on STM32H56x, PC0/PC1 are not LPUART1 pins ! use UARTE_USE_LPUART1_PA9PA10 or UARTE_USE_LPUART1_PB6PB7
      #else
        #error UARTE_USE_LPUART1_PC1PC0 not available on STM32H503 LQFP48, port C is not bonded !
      #endif
    #endif
  #endif

#else
  #error No UARTE_USE_UARTx defined!
#endif


// LPUART1 uses the LL_LPUART_xxx API instead of LL_USART_xxx, so several blocks below
// have to know which one was selected. define it once here rather than repeating the
// list of LPUART1 mappings at every use.
#if defined UARTE_USE_LPUART1 || defined UARTE_USE_LPUART1_PA2PA3 || defined UARTE_USE_LPUART1_PC1PC0 || \
    defined UARTE_USE_LPUART1_PA9PA10 || defined UARTE_USE_LPUART1_PB6PB7
  #define UARTE_IS_LPUART
#endif


// allows us to overwrite the default pin assignment
#ifdef UARTE_USE_TX_IO
  #undef UARTE_TX_IO
  #define UARTE_TX_IO             UARTE_USE_TX_IO
#endif
#ifdef UARTE_USE_RX_IO
  #undef UARTE_RX_IO
  #define UARTE_RX_IO             UARTE_USE_RX_IO
#endif
#ifdef UARTE_USE_IO_AF
  #undef UARTE_IO_AF
  #define UARTE_IO_AF             UARTE_USE_IO_AF
#endif


